{"meta":{"title":"周阿猫","subtitle":"","description":"","author":"Amao Zhou","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2021-05-08T03:03:44.000Z","updated":"2021-05-08T03:03:44.944Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"Publication","date":"2021-05-08T07:24:31.000Z","updated":"2021-05-08T07:24:31.183Z","comments":true,"path":"Publication/index.html","permalink":"http://example.com/Publication/index.html","excerpt":"","text":""},{"title":"about","date":"2020-09-14T07:30:30.000Z","updated":"2021-05-08T07:53:01.604Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":""}],"posts":[{"title":"A Practical Plateau Lake Extraction Algorithm Combining Novel Statistical Features and Kullback-Leibler Distance Using Synthetic Aperture Radar Imagery","slug":"Lake-extraction","date":"2021-05-08T02:41:22.000Z","updated":"2021-05-08T07:08:21.543Z","comments":true,"path":"2021/05/08/Lake-extraction/","link":"","permalink":"http://example.com/2021/05/08/Lake-extraction/","excerpt":"","text":"AbstractDue to wind-induced waves, dry sand and wet snow, and terrain shadows, the lake extraction from synthetic aperture radar (SAR) imagery in the Qinghai-Tibet Plateau (QTP) is accompanied by false alarms. In this paper, a practical plateau lake extraction algorithm combining novel statistical features and Kullback-Leibler distance (KLD) using SAR imagery has been proposed. Firstly, a mathematical description for the plateau lake surface called object-based generalized gamma distribution (OGD) features has been proposed, which is able to suppress the false alarms by using spatial context information as the large-scale descriptor. Secondly, the random forest (RF) classifier is used to train a multi-feature set, including conventional texture features and OGD features, and output an initial labeling result. Finally, to suppress the false alarms in the initial lake extraction results, automatic post-processing based on KLD has been used. The algorithm is tested by several experiments using Sentinel-1 SAR data, performing better than the state-of-the-art algorithms, achieving the overall accuracy (OA) of 99.54% while maintaining a false-alarm rate (FR) of 0.32%. CitationZhou X, Zhang Z, Chen Q, et al. A Practical Plateau Lake Extraction Algorithm Combining Novel Statistical Features and Kullback–Leibler Distance Using Synthetic Aperture Radar Imagery[J]. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2020, 13: 4702-4713.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-05-08T00:36:07.460Z","updated":"2021-05-08T00:36:07.460Z","comments":true,"path":"2021/05/08/hello-world/","link":"","permalink":"http://example.com/2021/05/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}