{"meta":{"title":"周阿猫","subtitle":"","description":"","author":"Amao Zhou","url":"https://zhouamao.github.io","root":"/"},"pages":[{"title":"CV","date":"2021-05-08T09:55:47.000Z","updated":"2021-05-09T12:44:12.006Z","comments":true,"path":"about/index.html","permalink":"https://zhouamao.github.io/about/index.html","excerpt":"","text":"ZHOU XIN (周欣)Zhou Xin received Bachelor degree in remote sensing science and technology, in 2018 from China University of Geosciences (CUG), Wuhan, where he worked on SAR image processing. He is currently working toward the Master degree in photogrammetry and remote sensing in CUG with focus on monitoring of soil freeze-thaw cycles. CONTACT| Email | ResearchGate | EDUCATIONFaculty of Information Engineering, China University of Geosciences (Wuhan) Bachelor of Remote Sensing Science and Technology (2014.9-2018.6) Classify PolSAR images using deep belief network and superpixel segmentation Detect power transmission tower using constant false alarm rate algorithm based on UAVSAR images School of Geography and Information Engineering, China University of Geosciences (Wuhan) Master of Photogrammetry and Remote Sensing (2018.9-2021.6) Extract water body area of lakes on Qinghai-Tibet Plateau using SAR statistical features and random forest algorithm Monitor soil freeze-thaw cycles in permafrost regions of the Qinghai-Tibet Plateau using the time series of scattering and coherence of Sentinel-1 images PUBLICATIONJournal[1] Zhou Xin, Zhang Zhengjia, Chen Qihao and Liu Xiuguo*. A practical plateau lake extraction algorithm combining novel statistical features and Kullback-Leibler distance using synthetic aperture radar imagery. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2020, 13: 4702-4713.[2] Zhou Xin, Zhang Zhengjia, Chen Qihao and Liu Xiuguo*. Using Sentinel-1 scattering and coherence time series for soil freeze-thaw state discrimination on permafrost regions of Qinghai-Tibet Plateau, Remote Sensing of Environment, 2021. (Under Review)[3] Zhou Xin, Zhou Junxiong, Xie Qinghua, Zhang Zhengjia, Chen Qihao, Liu Xiuguo*. Detection of soil freeze-thaw states at a high spatial resolution in Qinghai-Tibet Engineering Corridor. IEEE Geoscience and Remote Sensing Letters, 2021. (Under Review) Conference[1] Zhou Xin, Liu Xiuguo, Cheng Qihao and Zhang Zhengjia. Power transmission tower CFAR detection algorithm based on integrated superpixel window and adaptive statistical model. IEEE Geoscience and Remote Sensing Symposium, 2326-2329, Yokohama, 2019.[2] Zhou Xin, Liu Xiuguo, Zhang Zhengjia. Automatic extraction of lakes on the Qinghai-Tibet Plateau from Sentinel-1 SAR images. IEEE BIGSARDATA, Beijing, 2019. PROJECT The object decomposition method of high-resolution polarized SAR image, China National Natural Science Foundation, 2014-2018. The active layer thickness retrieval of the complex permafrost environment in the Qinghai-Tibet Plateau, China National Natural Science Foundation, 2019-2021. SKILL English language skill: fluent in using English for work and communications Computer skills: familiar with multiple programming environments, including C++, Python, MATLAB and IDL, proficient in using office software such as Word, Excel, PowerPoint Fast adaption to a new working environment and dedicated to efficient teamwork"},{"title":"tags","date":"2021-05-08T03:03:44.000Z","updated":"2021-05-08T14:05:55.228Z","comments":true,"path":"tags/index.html","permalink":"https://zhouamao.github.io/tags/index.html","excerpt":"","text":""},{"title":"Tool & Data","date":"2021-05-08T09:36:49.000Z","updated":"2021-05-09T05:57:05.791Z","comments":true,"path":"friends/index.html","permalink":"https://zhouamao.github.io/friends/index.html","excerpt":"","text":""},{"title":"Timeline","date":"2021-05-07T16:00:00.000Z","updated":"2021-05-09T11:43:38.873Z","comments":true,"path":"timeline/index.html","permalink":"https://zhouamao.github.io/timeline/index.html","excerpt":"","text":"2021-01-01 1.0.3 -&gt; 1.0.3 我是一个测试文字ghghgh。我是一个测试问题二’qweqw’，请问企鹅请问请问佛挡杀fgfgf佛第三节课。我是一个测试问题三’fgfgfg’，请问企鹅请问请问佛挡杀trtrtr佛第三节课。 2020-05-09 2021-05-08 本网站建立了"}],"posts":[{"title":"Detection of Soil Freeze-thaw States at A High Spatial Resolution in Qinghai-Tibet Engineering Corridor","slug":"QTEC-S1-SAR","date":"2021-05-08T11:27:56.000Z","updated":"2021-05-08T14:04:31.231Z","comments":true,"path":"2021/05/08/QTEC-S1-SAR/","link":"","permalink":"https://zhouamao.github.io/2021/05/08/QTEC-S1-SAR/","excerpt":"","text":"The freeze-thaw (FT) state of soil is an essential indicator for permafrost monitoring. However, generating a high spatial resolution FT map using optical remote sensing imagery remains challenging due to cloud contamination. In this letter, a new approach integrating images from two microwave sensors (i.e., Sentinel-1 and AMSR-2) was developed to identify the FT states of soil at a spatial resolution of 10m in the Qinghai-Tibet Engineering Corridor (QTEC). According to the empirical model, there is a monotonically increasing trend of the synthetic aperture radar (SAR) backscatter values as the land surface temperatures (LSTs) rise. Therefore, the high spatial resolution FT map can be produced employing thresholds extracted from AMSR-2 frozen frequency in Sentinel-1 SAR time-series images. We tested the FT results via both visual and quantitative evaluations. The FT maps for the four sub-areas are reasonable, and the overall accuracy for four meteorological stations achieves 83.07% and 77.10% for ascending and descending orbits, respectively. CitationZhou X, Zhou J, Xie Q, et al. Detection of Soil Freeze-thaw States at A High Spatial Resolution in Qinghai-Tibet Engineering Corridor[J]. IEEE Geoscience and Remote Sensing Letters, 2021.","categories":[],"tags":[{"name":"Soil freeze-thaw detection","slug":"Soil-freeze-thaw-detection","permalink":"https://zhouamao.github.io/tags/Soil-freeze-thaw-detection/"},{"name":"Sentinel-1","slug":"Sentinel-1","permalink":"https://zhouamao.github.io/tags/Sentinel-1/"},{"name":"AMSR-2","slug":"AMSR-2","permalink":"https://zhouamao.github.io/tags/AMSR-2/"},{"name":"synthetic aperture radar (SAR)","slug":"synthetic-aperture-radar-SAR","permalink":"https://zhouamao.github.io/tags/synthetic-aperture-radar-SAR/"},{"name":"Qinghai-Tibet Engineering Corridor (QTEC)","slug":"Qinghai-Tibet-Engineering-Corridor-QTEC","permalink":"https://zhouamao.github.io/tags/Qinghai-Tibet-Engineering-Corridor-QTEC/"}]},{"title":"Identifying soil freeze-thaw state using time-series high-resolution C-band synthetic aperture radar scattering and coherence in Qinghai-Tibet Plateau","slug":"S1-QTP-timeseries","date":"2021-05-08T06:41:22.000Z","updated":"2021-05-08T14:04:34.975Z","comments":true,"path":"2021/05/08/S1-QTP-timeseries/","link":"","permalink":"https://zhouamao.github.io/2021/05/08/S1-QTP-timeseries/","excerpt":"","text":"The soil freeze-thaw cycles play an important role in the climate system and human activities. However, the harsh and complex environment on the Qinghai-Tibet Plateau (QTP) poses great challenges for both in situ observation and remote sensing monitoring of the soil freeze-thaw process. In this paper, the spatiotemporal variation of the high-resolution time-series of Sentinel-1 C-band synthetic aperture radar (SAR) is analyzed for identifying the freeze-thaw state of the soil. The scattering, including intensity and decomposition parameters, and coherence, are analyzed with regions of interests (ROIs) of different landcover types. The second-order and fourth-order Fourier functions are used to fit the scattering and coherence time-series, respectively, to build the mathematical models of SAR features over time. Based on those models, the initial freeze-thaw times of the soil are detected, and the corresponding map can be given. The results are cross-validated with the initial freeze-thaw time of the soil obtained from the MODIS land surface temperature (LST) products, showing that the difference in days is less than one revisit cycle of Sentinel-1. Furthermore, the environmental factors acquired from the meteorological station, including air temperature, ground surface temperature, snow depth, and precipitation, are discussed for evaluating the possible impact on scattering and coherence. This finding has shown that Sentinel-1 has great potential for soil freeze-thaw monitoring, which can obtain soil freeze-thaw state with a high spatial-temporal resolution and provides the start and end time of the active layer freeze-thaw process indirectly. CitationZhou X, Zhang Z, Chen Q, et al. Identifying soil freeze-thaw state using time-series high-resolution C-band synthetic aperture radar scattering and coherence in Qinghai-Tibet Plateau[J]. Remote Sensing of Environment, 2021.","categories":[],"tags":[]},{"title":"A Practical Plateau Lake Extraction Algorithm Combining Novel Statistical Features and Kullback-Leibler Distance Using Synthetic Aperture Radar Imagery","slug":"Lake-extraction","date":"2021-05-08T02:41:22.000Z","updated":"2021-05-08T11:19:03.096Z","comments":true,"path":"2021/05/08/Lake-extraction/","link":"","permalink":"https://zhouamao.github.io/2021/05/08/Lake-extraction/","excerpt":"","text":"Due to wind-induced waves, dry sand and wet snow, and terrain shadows, the lake extraction from synthetic aperture radar (SAR) imagery in the Qinghai-Tibet Plateau (QTP) is accompanied by false alarms. In this paper, a practical plateau lake extraction algorithm combining novel statistical features and Kullback-Leibler distance (KLD) using SAR imagery has been proposed. Firstly, a mathematical description for the plateau lake surface called object-based generalized gamma distribution (OGD) features has been proposed, which is able to suppress the false alarms by using spatial context information as the large-scale descriptor. Secondly, the random forest (RF) classifier is used to train a multi-feature set, including conventional texture features and OGD features, and output an initial labeling result. Finally, to suppress the false alarms in the initial lake extraction results, automatic post-processing based on KLD has been used. The algorithm is tested by several experiments using Sentinel-1 SAR data, performing better than the state-of-the-art algorithms, achieving the overall accuracy (OA) of 99.54% while maintaining a false-alarm rate (FR) of 0.32%. CitationZhou X, Zhang Z, Chen Q, et al. A Practical Plateau Lake Extraction Algorithm Combining Novel Statistical Features and Kullback–Leibler Distance Using Synthetic Aperture Radar Imagery[J]. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2020, 13: 4702-4713.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-05-08T00:36:07.460Z","updated":"2021-05-08T00:36:07.460Z","comments":true,"path":"2021/05/08/hello-world/","link":"","permalink":"https://zhouamao.github.io/2021/05/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"Soil freeze-thaw detection","slug":"Soil-freeze-thaw-detection","permalink":"https://zhouamao.github.io/tags/Soil-freeze-thaw-detection/"},{"name":"Sentinel-1","slug":"Sentinel-1","permalink":"https://zhouamao.github.io/tags/Sentinel-1/"},{"name":"AMSR-2","slug":"AMSR-2","permalink":"https://zhouamao.github.io/tags/AMSR-2/"},{"name":"synthetic aperture radar (SAR)","slug":"synthetic-aperture-radar-SAR","permalink":"https://zhouamao.github.io/tags/synthetic-aperture-radar-SAR/"},{"name":"Qinghai-Tibet Engineering Corridor (QTEC)","slug":"Qinghai-Tibet-Engineering-Corridor-QTEC","permalink":"https://zhouamao.github.io/tags/Qinghai-Tibet-Engineering-Corridor-QTEC/"}]}